[
  {
    "review": "After searching for the best deal on an iPhone 15 Pro Max, I decided to take a chance on this Verizon-carrier refurbished model from Amazon with 256GB storage. I couldn't be happier with my decision!"
  },
  {
    "review": "I’m so glad I bought this phone! I’ve never had a newer phone and buying from Amazon was wayyy cheaper than buying from any carrier or even apple themselves. The battery life is at 100% and when I got the phone the cycle count was only 125. No scratches, nicks or cracks the phone was in perfect condition (very thankful for that.) For shipping it did arrive a day late but I’m sure it was just fedexs problem otherwise it came within 3-4 days of ordering. I also had no problem setting it up by myself."
  },
  {
    "review": "I purchased the Apple iPhone 15 Pro Max (Renewed) because I didn’t see the need to pay full price for a brand-new device. The phone arrived in an aftermarket box with a third-party charger, which I expected and had no issue with."
  },
  { "review": "***BUYERS WITH SKEPTICAL ANXIETY***" },
  {
    "review": "Perfect condition! Just as described. No flaws. Great battery life. I was hesitant to buy “renewed” but I am glad I did and saved a little money. No complaints!"
  },
  {
    "review": "I can't believe this - I had to transfer my physical sim because it came WITHOUT a sim tray, only to find out I couldn't activate my dual sims because 1 IMEI is still locked to a US provider (Boost Mobile) and I'm in Canada. Upon calling Boost directly, they said the phone was still on a plan and they could not help me, or remove the lock on the IMEI. I now don't have a phone or phone number I can use when I return this to Amazon.  I'm basically WITHOUT a phone.  Thanks a bunch guys.  I would have given you 1 star - if the phone was in bad condition, but it's good.  Thanks for making this a most PAINFUL experience and suck all the joy out of receiving a new iPhone."
  },
  {
    "review": "I don’t believe this one was even used that much . I love it it’s perfect"
  },
  {
    "review": "Got the phone and it had 100% battery which was unexpected but very welcomed. The phone runs very well but the screen came puzzlingly scratched. It’s as if the previous phone owner just took their nails and randomly scratched the screen before handing it off. Aside from that the screen runs at 120hz, phone has 100% battery and the phone runs very well so overall the phone is very satisfied with the purchase."
  },
  {
    "review": "El teléfono se encuentra en excelentes condiciones de estética, tal como lo describía el vendedor, ya está funcionando, sin detalle, el paquete llegó antes del tiempo propuesto de espera y eso también se agradece."
  },
  { "review": "Apple never disappoints." }
]
